1s/ERP/Conf/Documents/Лико_КартаПерерасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_КартаПерерасхода</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаявлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПодтверждено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияДокументаКартаПерерасхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТССтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сканы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_КартаПерерасхода/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
//
// Функция НайтиСоздать (адаптр)
//
/// Описание: Поиск или создание документа Лико_КартаПерерасхода 
//
// Параметры: 
// Данные 		   - Произвольный          	    - (обязательный).  П 
//
// Возвращаемое значение:
//  Документ.Лико_КаратаПерерасхода.Ссылка
//
Функция НайтиСоздать(Данные) Экспорт  //+Лико m.shenderov 01.07.2025
	
	Параметры = Неопределено;
	
	ПараметрыПоСтруктуре(Данные, Параметры);
	ПараметрыПоJSON(Данные, Параметры);	
	
	Если Параметры=Неопределено Тогда
		
		Ошибка = "Некорректный формат параметра ""Данные"" в функции Документы.Лико_КартаПерерасхода.НайтиСоздать(Данные).";		
		ВызватьИсключение(Ошибка);
		
	КонецЕсли;
	
	КартаПерерасхода = ДокументПоПараметрам(Параметры.Заказ,Параметры.НомерБланка,Параметры.НомерПроката,Параметры.СтатусЗаказаПерерасхода,Параметры.Оператор); 
	Если КартаПерерасхода =Неопределено Тогда
		
		ДокОбъект = СоздатьДокумент(); 
		ДокОбъект.Заполнить(Параметры);
		Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось создать карту перерасхода по заказу :%1
			|%2'"),
			Параметры.Заказ,
			СтрСоединить(ПолучитьСообщенияПользователю(), Символы.ПС)
			); 
		КонецЕсли;
	КонецЕсли; 
		
		
	
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КартаПерерасхода = ДокОбъект.Ссылка; 
		
	
	
	
	Возврат КартаПерерасхода;
	
КонецФункции //НайтиДокумент -Лико m.shenderov 01.07.2025

Функция ДокументПоПараметрам(Заказ,НомерБланка,НомерПроката,СтатусЗаказаПерерасхода,Оператор) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_КартаПерерасхода.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_КартаПерерасхода КАК Лико_КартаПерерасхода
		|ГДЕ
		|	Лико_КартаПерерасхода.Заказ = &Заказ
		|	И Лико_КартаПерерасхода.НомерПроката = &НомерПроката
		|	И Лико_КартаПерерасхода.НомерБланка = &НомерБланка
		|	И Лико_КартаПерерасхода.Статус = &Статус
		|	И НЕ Лико_КартаПерерасхода.ПометкаУдаления
		|	И Лико_КартаПерерасхода.Оператор = &Оператор";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("НомерБланка", НомерБланка);
	Запрос.УстановитьПараметр("Статус", СтатусЗаказаПерерасхода);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЕстьКартаСТакимиПараметрами(Объект) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_КартаПерерасхода.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_КартаПерерасхода КАК Лико_КартаПерерасхода
		|ГДЕ
		|	Лико_КартаПерерасхода.Заказ = &Заказ
		|	И Лико_КартаПерерасхода.НомерПроката = &НомерПроката
		|	И Лико_КартаПерерасхода.НомерБланка = &НомерБланка
		|	И Лико_КартаПерерасхода.Статус = &Статус
		|	И Лико_КартаПерерасхода.Оператор = &Оператор
		|	И НЕ Лико_КартаПерерасхода.ПометкаУдаления
		|	И Лико_КартаПерерасхода.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Заказ);
	Запрос.УстановитьПараметр("НомерБланка", Объект.НомерБланка);
	Запрос.УстановитьПараметр("НомерПроката", Объект.НомерПроката);
	Запрос.УстановитьПараметр("Оператор", Объект.Оператор);
	Запрос.УстановитьПараметр("Статус", Объект.Статус);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Карта = Новый Структура("Номер,Дата",ВыборкаДетальныеЗаписи.Ссылка.Номер,Формат(ВыборкаДетальныеЗаписи.Ссылка.Дата,"ДФ=dd.MM.yyyy"));
		Возврат Карта;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ЕстьПравоНаПодтверждение() Экспорт  //+Лико m.shenderov 02.07.2025

		Возврат (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ПодтверждениеКартПерерасхода"));		
       	
КонецФункции //-Лико m.shenderov 02.07.2025 

Функция КартыПерерасходаПоРабочемуЦентру(РабочийЦентр) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_КартаПерерасхода.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_КартаПерерасхода КАК Лико_КартаПерерасхода
	|ГДЕ
	|	Лико_КартаПерерасхода.РабочийЦентр = &РабочийЦентр
	|	И Лико_КартаПерерасхода.Проведен
	|	И НЕ Лико_КартаПерерасхода.ПометкаУдаления";
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 	
	
	

КонецФункции // КартыПерерасходаПоРабочемуЦентру()

Функция КартаПерерасходаВСтруктуру(Карта, Реквизиты = Неопределено, РеквизитыТолькоПросмотр = Неопределено, РеквизитыПроверкаЗаполнения = Неопределено) Экспорт 
	
	Результат = Новый Массив;

	
	Если (ЗначениеЗаполнено(Реквизиты) 
		И ТипЗнч(Реквизиты)=Тип("Массив") 
		И Реквизиты.Найти("Номер")<>Неопределено) 
		Или (Не ЗначениеЗаполнено(Реквизиты))  Тогда
		
		
				Структура = Новый Структура;
		Структура.Вставить("name","Номер");
		Структура.Вставить("synonym","Номер");
		Структура.Вставить("readOnly",Истина);
		Структура.Вставить("validationCheck",Истина);
		Структура.Вставить("value",Карта.Номер);
		Результат.Добавить(Структура);
		
		Структура = Новый Структура;
		Структура.Вставить("name","Дата");
		Структура.Вставить("synonym","Дата");
		Структура.Вставить("readOnly",Истина);
		Структура.Вставить("validationCheck",Истина);
		Структура.Вставить("value",Карта.Дата);
		Результат.Добавить(Структура);
		
	КонецЕсли;
	
	
	
	//Карта = Документы.Лико_КартаПерерасхода.СоздатьДокумент();
	Для каждого Реквизит Из Метаданные.Документы.Лико_КартаПерерасхода.Реквизиты  Цикл
		
		лТолькоПросмотр = Ложь;
		лПроверкаЗаполнения = Ложь;
		
		Если ЗначениеЗаполнено(Реквизиты) 
			И ТипЗнч(Реквизиты)=Тип("Массив") 
			И Реквизиты.Найти(Реквизит.Имя)=Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыТолькоПросмотр) 
			И ТипЗнч(РеквизитыТолькоПросмотр)=Тип("Массив") 
			И РеквизитыТолькоПросмотр.Найти(Реквизит.Имя)<>Неопределено Тогда
			
			лТолькоПросмотр = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПроверкаЗаполнения) 
			И ТипЗнч(РеквизитыПроверкаЗаполнения)=Тип("Массив") 
			И РеквизитыПроверкаЗаполнения.Найти(Реквизит.Имя)<>Неопределено Тогда
			
			лПроверкаЗаполнения = Истина;
			
		КонецЕсли;
		
		
		
		Структура = Новый Структура;
		Структура.Вставить("name",Реквизит.Имя);
		Структура.Вставить("synonym",Реквизит.Синоним);
		Структура.Вставить("readOnly",лТолькоПросмотр);
		Структура.Вставить("validationCheck",лПроверкаЗаполнения);
	    ЗначениеРеквизита =  Карта[Реквизит.Имя];	
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Карта[Реквизит.Имя])) Тогда
		ЗначениеРеквизита =  Строка(Карта[Реквизит.Имя]);	
			
		Если ТипЗнч(Карта[Реквизит.Имя])=Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			ДатаЗаказаСтруктура = Новый Структура;
		ДатаЗаказаСтруктура.Вставить("name","ЗаказДата");
		ДатаЗаказаСтруктура.Вставить("synonym","Дата");
		ДатаЗаказаСтруктура.Вставить("readOnly",Истина);
		ДатаЗаказаСтруктура.Вставить("validationCheck",Истина);
		ДатаЗаказаСтруктура.Вставить("value",Карта[Реквизит.Имя].Дата);
		
		Результат.Добавить(ДатаЗаказаСтруктура);
		  
			ЗначениеРеквизита =Карта[Реквизит.Имя].Номер;
		КонецЕсли;
		
		
		Если ТипЗнч(Карта[Реквизит.Имя])=Тип("ПеречислениеСсылка.ТССтатусыЗаказов") Тогда 
			МассивЗначений =Новый массив;
			МассивЗначений.Добавить("Настройка");
			МассивЗначений.Добавить("Печать");
			Структура.Вставить("possibleValues",МассивЗначений);
			
		КонецЕсли;
	КонецЕсли;
		Структура.Вставить("value",ЗначениеРеквизита);

		
		Результат.Добавить(Структура);
		
	КонецЦикла;
	
	
	Возврат Результат;
	
КонецФункции

Функция КартыПерерасходаВМассив(МассивКарт, Реквизиты = Неопределено, РеквизитыТолькоПросмотр = Неопределено, РеквизитыПроверкаЗаполнения = Неопределено) Экспорт 
	
	Результат = Новый Массив;
	//Карта = Документы.Лико_КартаПерерасхода.СоздатьДокумент();
	Для каждого Карта Из МассивКарт  Цикл
		
		СтруктураКрты = КартаПерерасходаВСтруктуру(Карта, Реквизиты, РеквизитыТолькоПросмотр, РеквизитыПроверкаЗаполнения);	
		Результат.Добавить(СтруктураКрты); 
		
	КонецЦикла;
	
	
	Возврат Результат;
	
КонецФункции 




#КонецОбласти 


#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

#КонецОбласти 

 Процедура ПараметрыПоСтруктуре(Данные, Результат) //+--->Лико m.shenderov 01.07.2025
	 
	 Если Результат <>Неопределено Тогда
		 
		 Возврат;
		 
	 КонецЕсли;
	 
	 Если ТипЗнч(Данные)<> Тип("Структура") Тогда 
		 
		 Возврат;
		 
	 КонецЕсли;
	 
	 Результат = Данные;
	 
 КонецПроцедуры //-<---Лико m.shenderov 01.07.2025
 
 Процедура ПараметрыПоJSON(Данные, Результат) //+--->Лико m.shenderov 01.07.2025
	 
	 Если Результат <>Неопределено Тогда
		 
		 Возврат;
		 
	 КонецЕсли;
	 
	 Если ТипЗнч(Данные)<> Тип("Строка") Тогда 
		 
		 Возврат;
		 
	 КонецЕсли;
	 
	 
 КонецПроцедуры //-<---Лико m.shenderov 01.07.2025
 
 
 


#КонецОбласти

#КонецЕсли
